balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ32MC202.PIC
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR11" edc:desc="" edc:impl="0x11f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000011111" edc:name="RPINR11" edc:nzwidth="0x10" edc:por="0000000000011111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OCFAR" edc:desc="" edc:mask="0x1f" edc:name="OCFAR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OCFAR0" edc:desc="" edc:mask="0x1" edc:name="OCFAR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR1" edc:desc="" edc:mask="0x1" edc:name="OCFAR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR2" edc:desc="" edc:mask="0x1" edc:name="OCFAR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR3" edc:desc="" edc:mask="0x1" edc:name="OCFAR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR4" edc:desc="" edc:mask="0x1" edc:name="OCFAR4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR12" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000011111" edc:name="RPINR12" edc:nzwidth="0x10" edc:por="0000000000011111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLTA1R" edc:desc="" edc:mask="0x1f" edc:name="FLTA1R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLTA1R0" edc:desc="" edc:mask="0x1" edc:name="FLTA1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA1R1" edc:desc="" edc:mask="0x1" edc:name="FLTA1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA1R2" edc:desc="" edc:mask="0x1" edc:name="FLTA1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA1R3" edc:desc="" edc:mask="0x1" edc:name="FLTA1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA1R4" edc:desc="" edc:mask="0x1" edc:name="FLTA1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR13" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000011111" edc:name="RPINR13" edc:nzwidth="0x10" edc:por="0000000000011111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLTA2R" edc:desc="" edc:mask="0x1f" edc:name="FLTA2R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLTA2R0" edc:desc="" edc:mask="0x1" edc:name="FLTA2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA2R1" edc:desc="" edc:mask="0x1" edc:name="FLTA2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA2R2" edc:desc="" edc:mask="0x1" edc:name="FLTA2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA2R3" edc:desc="" edc:mask="0x1" edc:name="FLTA2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA2R4" edc:desc="" edc:mask="0x1" edc:name="FLTA2R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPINR14" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0001111100011111" edc:name="RPINR14" edc:nzwidth="0x10" edc:por="0001111100011111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="QEA1R" edc:desc="" edc:mask="0x1f" edc:name="QEA1R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="QEB1R" edc:desc="" edc:mask="0x1f" edc:name="QEB1R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="QEA1R0" edc:desc="" edc:mask="0x1" edc:name="QEA1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA1R1" edc:desc="" edc:mask="0x1" edc:name="QEA1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA1R2" edc:desc="" edc:mask="0x1" edc:name="QEA1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA1R3" edc:desc="" edc:mask="0x1" edc:name="QEA1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA1R4" edc:desc="" edc:mask="0x1" edc:name="QEA1R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="QEB1R0" edc:desc="" edc:mask="0x1" edc:name="QEB1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB1R1" edc:desc="" edc:mask="0x1" edc:name="QEB1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB1R2" edc:desc="" edc:mask="0x1" edc:name="QEB1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB1R3" edc:desc="" edc:mask="0x1" edc:name="QEB1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB1R4" edc:desc="" edc:mask="0x1" edc:name="QEB1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR15" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000011111" edc:name="RPINR15" edc:nzwidth="0x10" edc:por="0000000000011111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INDX1R" edc:desc="" edc:mask="0x1f" edc:name="INDX1R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INDX1R0" edc:desc="" edc:mask="0x1" edc:name="INDX1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX1R1" edc:desc="" edc:mask="0x1" edc:name="INDX1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX1R2" edc:desc="" edc:mask="0x1" edc:name="INDX1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX1R3" edc:desc="" edc:mask="0x1" edc:name="INDX1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX1R4" edc:desc="" edc:mask="0x1" edc:name="INDX1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPINR18" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0001111100011111" edc:name="RPINR18" edc:nzwidth="0x10" edc:por="0001111100011111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXR" edc:desc="" edc:mask="0x1f" edc:name="U1RXR" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U1CTSR" edc:desc="" edc:mask="0x1f" edc:name="U1CTSR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1RXR0" edc:desc="" edc:mask="0x1" edc:name="U1RXR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR1" edc:desc="" edc:mask="0x1" edc:name="U1RXR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR2" edc:desc="" edc:mask="0x1" edc:name="U1RXR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR3" edc:desc="" edc:mask="0x1" edc:name="U1RXR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR4" edc:desc="" edc:mask="0x1" edc:name="U1RXR4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U1CTSR0" edc:desc="" edc:mask="0x1" edc:name="U1CTSR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR1" edc:desc="" edc:mask="0x1" edc:name="U1CTSR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR2" edc:desc="" edc:mask="0x1" edc:name="U1CTSR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR3" edc:desc="" edc:mask="0x1" edc:name="U1CTSR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR4" edc:desc="" edc:mask="0x1" edc:name="U1CTSR4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPINR20" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0001111100011111" edc:name="RPINR20" edc:nzwidth="0x10" edc:por="0001111100011111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SDI1R" edc:desc="" edc:mask="0x1f" edc:name="SDI1R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SCK1R" edc:desc="" edc:mask="0x1f" edc:name="SCK1R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SDI1R0" edc:desc="" edc:mask="0x1" edc:name="SDI1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R1" edc:desc="" edc:mask="0x1" edc:name="SDI1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R2" edc:desc="" edc:mask="0x1" edc:name="SDI1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R3" edc:desc="" edc:mask="0x1" edc:name="SDI1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R4" edc:desc="" edc:mask="0x1" edc:name="SDI1R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SCK1R0" edc:desc="" edc:mask="0x1" edc:name="SCK1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R1" edc:desc="" edc:mask="0x1" edc:name="SCK1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R2" edc:desc="" edc:mask="0x1" edc:name="SCK1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R3" edc:desc="" edc:mask="0x1" edc:name="SCK1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R4" edc:desc="" edc:mask="0x1" edc:name="SCK1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
